xml/InformationRegisters/ИИА_ЭмбеддингиЧанков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>ИИА_ЭмбеддингиЧанков</Name>
			<Comment>Хранение векторных представлений чанков RAG (Yandex Embeddings)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>КлючЧанка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>72</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Вектор</Name>
					<Comment>ХранилищеЗначения: Массив из 256 float (Yandex Embeddings)</Comment>
					<Type>
						<v8:Type>xs:base64Binary</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МодельЭмбеддинга</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаИндекса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

xml/CommonModules/ИИА_RAG_Эмбеддинги/Ext/Module.bsl
// Модуль работы с Yandex Foundation Models Embeddings API
// Реализует гибридный семантический поиск: TF-IDF + cosine rerank
//
// API: https://llm.api.cloud.yandex.net/foundationModels/v1/textEmbedding
// Модели: text-search-doc/latest (для документов), text-search-query/latest (для запросов)
// Вектор: 256 float

#Область ПрограммныйИнтерфейс

// Получить эмбеддинг текста через Yandex Foundation Models API
//
// Параметры:
//  Текст - Строка - текст для векторизации
//  ТипМодели - Строка - "query" или "doc" (по умолчанию "query")
//  НастройкиЭмбеддингов - Структура - FolderId, ApiKey
//
// Возвращаемое значение:
//  Структура - Успех (Булево), Вектор (Массив), Ошибка (Строка)
//
Функция ПолучитьЭмбеддинг(Текст, ТипМодели = "query", НастройкиЭмбеддингов = Неопределено) Экспорт

	Результат = Новый Структура("Успех,Вектор,Ошибка", Ложь, Новый Массив, "");

	Если ПустаяСтрока(СокрЛП(Текст)) Тогда
		Результат.Ошибка = "Пустой текст для эмбеддинга.";
		Возврат Результат;
	КонецЕсли;

	Настройки = НастройкиЭмбеддингов;
	Если Настройки = Неопределено Тогда
		Настройки = ПолучитьНастройкиЭмбеддингов();
	КонецЕсли;

	Если НЕ Настройки.Свойство("FolderId") ИЛИ ПустаяСтрока(Настройки.FolderId) Тогда
		Результат.Ошибка = "Не указан FolderId для Yandex Embeddings.";
		Возврат Результат;
	КонецЕсли;

	Если НЕ Настройки.Свойство("ApiKey") ИЛИ ПустаяСтрока(Настройки.ApiKey) Тогда
		Результат.Ошибка = "Не указан ApiKey для Yandex Embeddings.";
		Возврат Результат;
	КонецЕсли;

	// Формируем имя модели
	ИмяМодели = ?(ТипМодели = "doc", "text-search-doc", "text-search-query");
	ModelUri = "emb://" + Настройки.FolderId + "/" + ИмяМодели + "/latest";

	// Формируем тело запроса
	ТелоЗапроса = Новый Структура;
	ТелоЗапроса.Вставить("modelUri", ModelUri);
	ТелоЗапроса.Вставить("text", Лев(Текст, 8000)); // Ограничение длины текста

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ТелоЗапроса);
	JSONТело = ЗаписьJSON.Закрыть();

	// Заголовки
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("Authorization", "Api-Key " + Настройки.ApiKey);
	Заголовки.Вставить("x-data-logging-enabled", "false");

	// HTTP-вызов
	БазовыйДомен = "llm.api.cloud.yandex.net";
	URLПуть = "/foundationModels/v1/textEmbedding";

	РезультатHTTP = ИИА_Провайдеры.ВыполнитьHTTPИнструмент(БазовыйДомен, URLПуть, Заголовки, JSONТело, 30, 3, 443, Истина);

	Если НЕ РезультатHTTP.Успех Тогда
		Результат.Ошибка = "Ошибка HTTP при получении эмбеддинга: " + ?(РезультатHTTP.Свойство("Ошибка") И РезультатHTTP.Ошибка <> Неопределено, Строка(РезультатHTTP.Ошибка), Строка(РезультатHTTP.КодСостояния));
		Возврат Результат;
	КонецЕсли;

	// Разбираем ответ
	Попытка
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(РезультатHTTP.Тело);
		ОтветJSON = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
	Исключение
		Результат.Ошибка = "Ошибка разбора JSON ответа Yandex Embeddings: " + ОписаниеОшибки();
		Возврат Результат;
	КонецПопытки;

	Если ТипЗнч(ОтветJSON) = Тип("Соответствие") И ОтветJSON.Получить("embedding") <> Неопределено Тогда
		Результат.Вектор = ОтветJSON.Получить("embedding");
		Результат.Успех = Истина;
	ИначеЕсли ТипЗнч(ОтветJSON) = Тип("Структура") И ОтветJSON.Свойство("embedding") Тогда
		Результат.Вектор = ОтветJSON.embedding;
		Результат.Успех = Истина;
	Иначе
		Результат.Ошибка = "Неожиданный формат ответа Yandex Embeddings: " + Лев(РезультатHTTP.Тело, 500);
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Вычислить косинусное сходство двух векторов
//
// Параметры:
//  Вектор1 - Массив - первый вектор (float[])
//  Вектор2 - Массив - второй вектор (float[])
//
// Возвращаемое значение:
//  Число - сходство от -1 до 1 (1 = идентичны)
//
Функция КосинусноеСходство(Вектор1, Вектор2) Экспорт

	Если Вектор1.Количество() = 0 ИЛИ Вектор2.Количество() = 0 Тогда
		Возврат 0;
	КонецЕсли;

	Размерность = Мин(Вектор1.Количество(), Вектор2.Количество());

	СкалярноеПроизведение = 0;
	НормаА = 0;
	НормаБ = 0;

	Для Инд = 0 По Размерность - 1 Цикл
		А = Число(Вектор1[Инд]);
		Б = Число(Вектор2[Инд]);
		СкалярноеПроизведение = СкалярноеПроизведение + А * Б;
		НормаА = НормаА + А * А;
		НормаБ = НормаБ + Б * Б;
	КонецЦикла;

	Если НормаА = 0 ИЛИ НормаБ = 0 Тогда
		Возврат 0;
	КонецЕсли;

	Возврат СкалярноеПроизведение / (Sqrt(НормаА) * Sqrt(НормаБ));

КонецФункции

// Индексировать чанк — получить и сохранить эмбеддинг
//
// Параметры:
//  КлючЧанка - Строка - ключ чанка из ИИА_Чанки
//  ТекстЧанка - Строка - текст чанка для векторизации
//  НастройкиЭмбеддингов - Структура - FolderId, ApiKey (опционально)
//
Процедура ИндексироватьЧанк(КлючЧанка, ТекстЧанка, НастройкиЭмбеддингов = Неопределено) Экспорт

	Если ПустаяСтрока(ТекстЧанка) Тогда
		Возврат;
	КонецЕсли;

	РезультатЭмб = ПолучитьЭмбеддинг(ТекстЧанка, "doc", НастройкиЭмбеддингов);

	Если НЕ РезультатЭмб.Успех Тогда
		Возврат;
	КонецЕсли;

	// Сохраняем вектор в регистр
	Попытка
		МенеджерЗаписи = РегистрыСведений.ИИА_ЭмбеддингиЧанков.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.КлючЧанка = КлючЧанка;
		МенеджерЗаписи.Вектор = Новый ХранилищеЗначения(РезультатЭмб.Вектор);
		МенеджерЗаписи.МодельЭмбеддинга = "text-search-doc";
		МенеджерЗаписи.ДатаИндекса = ТекущаяДата();
		МенеджерЗаписи.Записать();
	Исключение
		// Логируем ошибку, но не прерываем индексацию
	КонецПопытки;

КонецПроцедуры

// Rerank кандидатов по эмбеддинг-сходству (гибридный подход)
//
// Параметры:
//  ТекстЗапроса - Строка - текст поискового запроса пользователя
//  МассивКандидатов - Массив из Структура - кандидаты с полями КлючЧанка, Скор (TF-IDF скор)
//  ТопK - Число - количество лучших результатов (по умолчанию 5)
//  НастройкиЭмбеддингов - Структура - FolderId, ApiKey (опционально)
//
// Возвращаемое значение:
//  Массив из Структура - отсортированные кандидаты с добавленным полем СкорЭмбеддинга
//
Функция RerankПоЭмбеддингам(ТекстЗапроса, МассивКандидатов, ТопK = 5, НастройкиЭмбеддингов = Неопределено) Экспорт

	Если МассивКандидатов.Количество() = 0 Тогда
		Возврат МассивКандидатов;
	КонецЕсли;

	// Получаем эмбеддинг запроса
	РезультатЗапроса = ПолучитьЭмбеддинг(ТекстЗапроса, "query", НастройкиЭмбеддингов);
	Если НЕ РезультатЗапроса.Успех Тогда
		// Если эмбеддинги недоступны, возвращаем оригинальный список
		Возврат МассивКандидатов;
	КонецЕсли;

	ВекторЗапроса = РезультатЗапроса.Вектор;

	// Загружаем векторы кандидатов из регистра
	КлючиЧанков = Новый Массив;
	Для Каждого Кандидат Из МассивКандидатов Цикл
		КлючиЧанков.Добавить(Кандидат.КлючЧанка);
	КонецЦикла;

	ВекторыЧанков = ЗагрузитьВекторыЧанков(КлючиЧанков);

	// Рассчитываем cosine similarity и комбинированный скор
	МаксСкорTFIDF = 0;
	Для Каждого Кандидат Из МассивКандидатов Цикл
		Если Кандидат.Скор > МаксСкорTFIDF Тогда
			МаксСкорTFIDF = Кандидат.Скор;
		КонецЕсли;
	КонецЦикла;
	Если МаксСкорTFIDF = 0 Тогда
		МаксСкорTFIDF = 1;
	КонецЕсли;

	ТаблицаРанга = Новый ТаблицаЗначений;
	ТаблицаРанга.Колонки.Добавить("Индекс", Новый ОписаниеТипов("Число"));
	ТаблицаРанга.Колонки.Добавить("КомбинированныйСкор", Новый ОписаниеТипов("Число"));

	Для Инд = 0 По МассивКандидатов.Количество() - 1 Цикл
		Кандидат = МассивКандидатов[Инд];
		ВекторЧанка = ВекторыЧанков.Получить(Кандидат.КлючЧанка);

		НормализованныйTFIDF = Кандидат.Скор / МаксСкорTFIDF;
		СходствоЭмбеддинга = 0;

		Если ВекторЧанка <> Неопределено И ТипЗнч(ВекторЧанка) = Тип("Массив") И ВекторЧанка.Количество() > 0 Тогда
			СходствоЭмбеддинга = КосинусноеСходство(ВекторЗапроса, ВекторЧанка);
		Иначе
			// Если нет эмбеддинга для чанка, используем только TF-IDF
			СходствоЭмбеддинга = НормализованныйTFIDF;
		КонецЕсли;

		// Комбинированный скор: 30% TF-IDF + 70% Embedding
		КомбинированныйСкор = 0.3 * НормализованныйTFIDF + 0.7 * Макс(СходствоЭмбеддинга, 0);

		Строка = ТаблицаРанга.Добавить();
		Строка.Индекс = Инд;
		Строка.КомбинированныйСкор = КомбинированныйСкор;
	КонецЦикла;

	ТаблицаРанга.Сортировать("КомбинированныйСкор УБЫВ");

	// Собираем результат
	РезультатRerank = Новый Массив;
	Счетчик = 0;
	Для Каждого СтрокаРанга Из ТаблицаРанга Цикл
		Если Счетчик >= ТопK Тогда
			Прервать;
		КонецЕсли;
		Кандидат = МассивКандидатов[СтрокаРанга.Индекс];
		Кандидат.Вставить("СкорЭмбеддинга", СтрокаРанга.КомбинированныйСкор);
		РезультатRerank.Добавить(Кандидат);
		Счетчик = Счетчик + 1;
	КонецЦикла;

	Возврат РезультатRerank;

КонецФункции

// Проверяет доступность Yandex Embeddings API
//
// Возвращаемое значение:
//  Булево - Истина, если настройки заполнены и API доступен
//
Функция ЭмбеддингиДоступны() Экспорт
	Настройки = ПолучитьНастройкиЭмбеддингов();
	Возврат Настройки.Свойство("FolderId") И НЕ ПустаяСтрока(Настройки.FolderId)
		И Настройки.Свойство("ApiKey") И НЕ ПустаяСтрока(Настройки.ApiKey)
		И Настройки.Свойство("Enabled") И Настройки.Enabled;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Получить настройки Yandex Embeddings из пользовательских настроек
Функция ПолучитьНастройкиЭмбеддингов()
	Результат = Новый Структура("FolderId,ApiKey,Enabled", "", "", Ложь);

	Попытка
		НастройкиПользователя = ИИА_Сервер.ПолучитьНастройкиПользователя();
		Если НастройкиПользователя <> Неопределено Тогда
			// Пробуем получить настройки Yandex из общих настроек провайдера
			Если НастройкиПользователя.Свойство("YandexEmbeddings_FolderId") Тогда
				Результат.FolderId = НастройкиПользователя.YandexEmbeddings_FolderId;
			КонецЕсли;
			Если НастройкиПользователя.Свойство("YandexEmbeddings_ApiKey") Тогда
				Результат.ApiKey = НастройкиПользователя.YandexEmbeddings_ApiKey;
			КонецЕсли;
			Если НастройкиПользователя.Свойство("YandexEmbeddings_Enabled") Тогда
				Результат.Enabled = НастройкиПользователя.YandexEmbeddings_Enabled;
			Иначе
				// По умолчанию включены, если FolderId и ApiKey заданы
				Результат.Enabled = НЕ ПустаяСтрока(Результат.FolderId) И НЕ ПустаяСтрока(Результат.ApiKey);
			КонецЕсли;
		КонецЕсли;
	Исключение
		// Настройки недоступны — эмбеддинги отключены
	КонецПопытки;

	Возврат Результат;
КонецФункции

// Загрузить векторы чанков из регистра ИИА_ЭмбеддингиЧанков
//
// Параметры:
//  КлючиЧанков - Массив из Строка - ключи чанков
//
// Возвращаемое значение:
//  Соответствие - КлючЧанка → Массив (вектор)
//
Функция ЗагрузитьВекторыЧанков(КлючиЧанков)

	Результат = Новый Соответствие;

	Если КлючиЧанков.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;

	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Т.КлючЧанка КАК КлючЧанка,
		|	Т.Вектор КАК Вектор
		|ИЗ
		|	РегистрСведений.ИИА_ЭмбеддингиЧанков КАК Т
		|ГДЕ
		|	Т.КлючЧанка В (&КлючиЧанков)";
		Запрос.УстановитьПараметр("КлючиЧанков", КлючиЧанков);

		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Вектор = Выборка.Вектор;
			Если ТипЗнч(Вектор) = Тип("ХранилищеЗначения") Тогда
				Вектор = Вектор.Получить();
			КонецЕсли;
			Результат.Вставить(Выборка.КлючЧанка, Вектор);
		КонецЦикла;
	Исключение
		// Регистр может не существовать в старых версиях расширения
	КонецПопытки;

	Возврат Результат;

КонецФункции

#КонецОбласти
